programming/golang/in-go-way.org.html
<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf8"></meta>
    <title>in-go-way.org</title>
    <link rel="stylesheet" href="/diary/resources/css/main.css" />
    <link rel="stylesheet" href="/diary/resources/highlight/styles/default.css" />
  </head>
  <body>
    <section class="main-article-area">
      <nav id='content'>
	<span id="prev">
	  	
	  <a href="/diary/programming/golang/how-to-write-go-code.org.html">Prev: how-to-write-go-code.org</a>
	  	
	</span>

	<span id="home"><a href="/diary">Home</a></span>
	<span id="Up">
	  
	  <a href="/diary/programming/golang">Up: golang</a>
	  	
	</span>

	<span id="next">
	  
	  <a href="/diary/programming/golang/learn-go-note">Next: learn-go-note</a>
	  	
	</span>
      </nav>
      
      <div id='main'>
	<h1 id="no-package-level-variable">NO package level variable</h1>
<p>Life each of the dependencies into the signature as parameters</p>
<p>from <a href="https://peter.bourgon.org/blog/2017/06/09/theory-of-modern-go.html">https://peter.bourgon.org/blog/2017/06/09/theory-of-modern-go.html</a></p>
<div class="sourceCode" id="cb1"><pre class="sourceCode go"><code class="sourceCode go"><span id="cb1-1"><a href="#cb1-1"></a><span class="co">// RowQueryer models part of a database/sql.DB.</span></span>
<span id="cb1-2"><a href="#cb1-2"></a><span class="kw">type</span> RowQueryer <span class="kw">interface</span> {</span>
<span id="cb1-3"><a href="#cb1-3"></a>    QueryRow(<span class="dt">string</span>, ...<span class="kw">interface</span>{}) *sql.Row</span>
<span id="cb1-4"><a href="#cb1-4"></a>}</span>
<span id="cb1-5"><a href="#cb1-5"></a></span>
<span id="cb1-6"><a href="#cb1-6"></a><span class="co">// Requestor models the requesting side of a resource.Pool.</span></span>
<span id="cb1-7"><a href="#cb1-7"></a><span class="kw">type</span> Requestor <span class="kw">interface</span> {</span>
<span id="cb1-8"><a href="#cb1-8"></a>    Request(n <span class="dt">int</span>) (*resource.Value, <span class="dt">error</span>)</span>
<span id="cb1-9"><a href="#cb1-9"></a>}</span>
<span id="cb1-10"><a href="#cb1-10"></a></span>
<span id="cb1-11"><a href="#cb1-11"></a><span class="kw">func</span> NewObject(q RowQueryer, r Requestor, n <span class="dt">int</span>, logger log.Logger) (*Object, <span class="dt">error</span>) {</span>
<span id="cb1-12"><a href="#cb1-12"></a>    <span class="co">// ...</span></span>
<span id="cb1-13"><a href="#cb1-13"></a>}</span></code></pre></div>
<h1 id="no-func-init">NO func init</h1>

      </div>
    </section>
  </body>
</html>
